Revit 2027 API
ParameterTypeId.RbsElecCircuitNaming Property
 "Circuit Naming"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsElecCircuitNaming { get; }
Public Shared ReadOnly Property RbsElecCircuitNaming As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsElecCircuitNaming {
	ForgeTypeId^ get ();
}
static member RbsElecCircuitNaming : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace